{
  "title": "Has Trump's control over the GOP in Congress waned? It's complicated.",
  "text": "Updated Jan. 19, 2026, 6:58 a.m. ET\n\nWASHINGTON – Republicans, led by President Donald Trump, control Congress.\n\nWell, depending on the day.\n\nAn ever-slimming voting margin in the House of Representatives is becoming a bigger problem for the White House and House Speaker Mike Johnson. Mavericks in the Senate are increasingly voicing frustrations, too, with party leadership over issues like foreign policy and health care.\n\nThe changing political dynamics are revealing Republican divisions that threaten to derail what could be Trump's last chance to pass significant legislation if Democrats win control of at least one house of Congress in November.\n\nTo kick off the important year heading into the midterm elections, the president in the first week of January rallied GOP lawmakers at a retreat in Washington. In a speech to the crowd of House Republicans, he stressed they have \"so many good nuggets,\" to campaign on this year. In particular, he highlighted revenue brought in from tariffs and the White House's negotiations to bring down prescription drug prices.\n\n\"If you can sell them, we’re going to win,” he said.\n\nYet the chances of Republicans holding on to the House in the midterms, which would buck historical trends, are looking worse. A YouGov/Yahoo News poll of more than 1,100 voters in January showed Democrats with a five-point lead.\n\nTrump has already acknowledged the voting math in Congress is becoming less forgiving.\n\nSeveral unexpected vacancies – including those left by Georgia Rep. Marjorie Taylor Greene's sudden resignation and California Rep. Doug LaMalfa's tragic death – have dwindled the Republican majority to a two-vote margin, which includes lawmakers who've left for family emergencies or have other attendance issues.\n\nRepublicans can now barely afford a single defection on any vote.\n\n“You can’t be tough when you have a majority of three,\" Trump said at the retreat. \"And now, sadly, a little bit less than that.\"\n\nA House divided\n\nAt the start of Trump's second term last year, House Republicans led by Speaker Johnson stayed unified to usher big pieces of legislation across the finish line. That included the president's so-called \"One Big Beautiful Bill Act,\" a massive domestic policy law and arguably his defining legislative achievement since returning to office.\n\nBut cracks in the coalition have started to show. Several Republican lawmakers defied the White House by joining Democrats to support the Epstein Files Transparency Act. They also passed an extension of health care subsidies that top Republicans don't support. And many of them joined with Democrats to protect federal workers' bargaining rights by supporting a repeal of one of Trump's executive orders.\n\nDuring recent 11th-hour scrambles on the House floor, GOP leaders have had to assuage the concerns of protesting lawmakers, both centrists and hardliners, in order to move bills. A conservative uproar, for example, over a $1 million earmark for an organization that provides substance abuse recovery and mental health treatment for Minneapolis' East African community nearly tanked a government funding package.\n\nThe weak majority in the House of Representatives was on full display on Jan. 13, when a handful of pro-labor Republicans defected from leadership to sink a bill that would have relaxed overtime rules for certain employers.\n\nSome House Republicans are openly venting about the challenges of having such a small advantage over Democrats. It pits more moderate wings of the party against the more conservative ones, Rep. Tim Burchett, R-Tennessee, told USA TODAY.\n\n\"They just want to move up the chain,\" he said of his more centrist colleagues in the GOP. \"And they don't care how badly they screw over our great country.\"\n\nThe situation is handing dueling elements of Speaker Johnson's ranks outsized power, rendering one of his most important roles – the ability to control what legislation comes up for a vote – markedly weaker.\n\nSome Republicans are fine with that. Pennsylvania Rep. Brian Fitzpatrick, one of the GOP lawmakers who broke with his party on Jan. 13, told USA TODAY he believes that ideas, especially ones supported by most members of Congress and the American people, should ultimately control which bills lawmakers vote on – not party leadership.\n\n\"That's going to run the gamut,\" he said. \"It could Ukraine. It could be health care. It could be border security. Anything that has 218 votes should get floor time. That's the way I look at it.\"\n\nOne of the most glaring examples of a political issue overpowering partisan divides was the November vote to compel the Justice Department to release all its information about the late alleged sex trafficker Jeffrey Epstein.\n\nMany Republicans were initially loathe to cross the White House (Trump initially didn't support the Epstein Files Transparency Act). But after a handful of conservatives contracted the president, the rest of the caucus – and Trump himself – came around to supporting the legislation, too.\n\nThrough it all, Johnson − whose office did not immediately respond to a request for comment − has continued to project confidence about the state of the House GOP. At a recent press conference, he said he's been working with a \"razor-thin\" majority since he first became speaker in 2023. His party has still defied expectations \"over and over,\" he said.\n\n\"We're totally in control of the House,\" the speaker told reporters on Jan. 13. \"This is life with a small margin.\"\n\nRead more: GOP divisions on display as House votes to extend Obamacare subsidies\n\nMuted defiance in the Senate\n\nIn the Senate, Republicans hold a slightly healthier majority: 53 seats within the 100-person chamber. Thanks to that margin, the GOP delivered critical wins to Trump last year, including the confirmation of key presidential appointments.\n\nTwo issues, however, have recently highlighted the limits on Trump's control over the Senate.\n\nThe first is health care. While Senate Republicans largely stuck together during the record-breaking government shutdown last year, Democrats capitalized on the crisis to bring attention to lapsing health care subsidies that expired at the beginning of the year, raising premiums for millions of Americans. Four Senate Republicans voted with Democrats in December to extend the tax credits (the last-ditch measure still failed).\n\nRead more: Health care costs are set to rise for millions as Senate rejects bill\n\nThen there's foreign policy. Five Senate Republicans angered the president on Jan. 8 by advancing a bipartisan measure to block Trump from any further military action in Venezuela. Though that bill, a war powers resolution, was eventually killed after the White House intervened to flip two Republicans on the next vote, it was a notable moment of discord within the GOP.\n\nAn even bigger pain point is Trump's bid to acquire Greenland. GOP leaders in the Senate have indicated that military action to annex the territory of Denmark, a NATO ally, would cross a red line for them.\n\n\"We need to not threaten a peaceful nation that’s an ally where we have a military base already,\" said Sen. James Lankford, R-Oklahoma.\n\nRead more: Republicans skeptical Trump will use military action against Greenland\n\nDemocrats, meanwhile, are strategizing to put Republicans' discontent over Greenland to the test. Sen. Tim Kaine, a Virginia Democrat who authored the bill to curb further military intervention in Venezuela, said he's planning similar legislation aimed at stopping hostilities in Greenland.\n\nRegardless of whether that bill succeeds, Kaine told Punchbowl News on Jan. 15 that the White House has been paying a lot of attention to his war powers legislation. As the bill worked its way through Congress, Trump administration officials called off a second incursion into Venezuela, Kaine pointed out (Trump has said this was due to increased cooperation from leaders of the Latin American country, not congressional scrutiny). Top Trump administration officials have also publicly committed, Kaine said, to not formally putting more boots on the ground in the country without congressional authorization.\n\n\"What I've learned from doing this is that even when you lose, you change behavior,\" he said. \"And changing behavior is a good thing.\"\n\nZachary Schermele is a congressional reporter for USA TODAY. You can reach him by email at zschermele@usatoday.com. Follow him on X at @ZachSchermele and Bluesky at @zachschermele.bsky.social.",
  "images": [
    "https://www.usatoday.com/gcdn/authoring/authoring-images/2026/01/14/USAT/88183104007-johnson-gop-house-of-representatives.jpg?crop=5428,3054,x0,y282&width=3200&height=1801&format=pjpg&auto=webp",
    "https://www.usatoday.com/gciaf/prod/p?a=pageview&p=USAT-TEALIUM-TANGENT&m=web&k=f14ebdd6-0569-4c64-af73-99937bc06379&s=noscript",
    "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/07/08/USAT/74332447007-xxx-usat-886362-021560.JPG?crop=3999,4000,x0,y0&width=48&height=48&format=pjpg&auto=webp"
  ]
}