{
  "title": "Arizona police break up 100-person fight at youth sports game",
  "text": "All remaining games for the football and soccer tournament were canceled.\n\nMultiple police agencies in Arizona responded to a brawl involving about 100 people at a youth sports game on Sunday, according to authorities.\n\nThe altercation began at the Arizona Athletic Grounds in Mesa around 1 p.m. Sunday during a flag football game when about 10 players from each team began to fight, according to a statement from the Mesa Police Department.\n\nThe fight then escalated when parents and spectators became involved, police said.\n\nArizona Athletic Grounds in Mesa, Ariz. Google Maps Street View\n\nVideo taken at the scene by ABC Phoenix affiliate KNXV shows law enforcement officers driving onto soccer fields and spectators walking away from the sports complex.\n\nOne 15-year-old player who was at the event told KNXV that he witnessed about 30 law enforcement vehicles on the fields, with officers instructing the crowds of people to leave.\n\n\"It was crazy,\" he said. \"It was hard to get out. It took like ten, fifteen minutes just to get out of there.\"\n\nRed Zone Elite Tournaments, organizer of the MLK Jamboree sports tournament that took place on Saturday and Sunday, posted an apology to its Instagram, saying in part that safety is the \"top priority\" at its events.\n\n\"We apologize for the disappointment in the abrupt end to our tournament this afternoon, but we stand behind the Mesa Police Departments decision in response to the situation -- to ensure the safety of everyone at the fields,\" the youth sports organization further said. \"Providing friendly, respectful and safe competition is our mission and we do not support violence, bullying or harassment in any way.\"\n\nOne of the teams involved apologized, stating that multiple players would be suspended, KNXV reported.\n\nDetails on what sparked the altercation were not released by police, who said all remaining games for the soccer and football tournament were canceled.\n\nSeventy officers total responded to the scene, including 37 officers from the Mesa Police Department, 22 officers from the Gilbert Police Department, eight officers from the Queen Creek Police Department and three deputies from the Maricopa County Sheriff's Office, according to the Mesa Police Department statement.\n\nAll of the soccer fields were cleared out about 45 minutes after officers arrived on the scene, police said.\n\n\"We wish to thank all agencies that responded for their assistance in taking control of the situation swiftly and safely,\" the Mesa Police Department said.\n\nNo injuries to youth players, parents or spectators were reported, and no arrests were made, according to the Mesa Police Department.",
  "images": [
    "https://assets-cdn.abcotvs.net/static/images/DisneyPlus.svg",
    "https://i.abcnewsfe.com/a/5bf930a4-12db-4cfa-bb79-cdaf433aa8c7/2255579468_1768359373339_hpMain_square.jpg?w=208",
    "https://i.abcnewsfe.com/a/c63169ca-daa1-4713-93a6-52132efd66a6/arizona-ht-er-260119_1768852425916_hpMain_16x9.jpg?w=992",
    "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7",
    "https://i.abcnewsfe.com/a/d4122765-c172-4d56-83d8-628ba61fc226/USA-TRUMP-MINNESOTA_1768701595891_hpMain_square.jpg?w=208",
    "https://i.abcnewsfe.com/a/c63169ca-daa1-4713-93a6-52132efd66a6/arizona-ht-er-260119_1768852425916_hpMain.jpg",
    "https://i.abcnewsfe.com/a/c63169ca-daa1-4713-93a6-52132efd66a6/arizona-ht-er-260119_1768852425916_hpMain_16x9.jpg?w=1600",
    "https://i.abcnewsfe.com/a/2b65849e-6816-43ff-9cb3-4346919e8a16/danish-frigate-greenland-20260118-gty-jh_1768769070875_hpMain_square.jpg?w=208",
    "https://i.abcnewsfe.com/a/f83c2aa6-e764-4dc3-b33b-b7e3ca0e71c6/spain-train-5-rt-gmh-260119._1768833074243_hpMain_square.jpg?w=208"
  ],
  "top_image": "https://i.abcnewsfe.com/a/c63169ca-daa1-4713-93a6-52132efd66a6/arizona-ht-er-260119_1768852425916_hpMain_16x9.jpg?w=1600",
  "url": "https://abcnews.go.com/US/arizona-police-break-100-person-fight-youth-sports/story?id=129348168"
}