{
  "title": "13K pounds of frozen chicken breast recalled due to listeria risk",
  "text": "Jan. 19, 2026, 10:12 a.m. ET\n\nMore than 13,000 pounds of frozen chicken breast have been recalled due to a potential listeria contamination.\n\nSuzanna's Kitchen, based in Georgia, recalled about 13,720 pounds of ready-to-eat grilled chicken breast fillets because they may pose a risk of listeria monocytogenes, the U.S. Department of Agriculture's (USDA) Food and Safety Inspection Service (FSIS) announced on Jan. 16.\n\nThe potential contamination was discovered when a third-party lab sample reported positive for listeria in the chicken breast fillets. As of Jan. 16, there were no confirmed reports of illness due to consumption of the chicken breasts, according to the FSIS.\n\nHere's what to know about the chicken breast recall.\n\nWhat is listeria? Plus, how to reduce your risk before next outbreak\n\nWhat frozen chicken breasts are recalled?\n\nThe recalled grilled chicken breast fillets were sold in 10-pound cases containing 5-pound bags. The lot code is 60104 P1382 287 5 J14, which is located on the side of the case and on the two bags.\n\nThe recalled chicken breasts were produced on Oct. 14, 2025, according to the FSIS.\n\nTake a look at the label of the recalled chicken breasts below:\n\nWhere were the recalled frozen chicken breasts sold?\n\nThe recalled frozen chicken breast fillets were distributed in Alabama, Florida, Georgia, Missouri, New Hampshire, North Carolina and Ohio, according to the FSIS.\n\nWhat to do if you own recalled frozen chicken breasts\n\nConsumers who own the recalled chicken breasts should throw them away or return them to the place of purchase immediately.\n\nConsumers with questions should contact Suzanna's Kitchen Customer Service Director Dawn Duncan at dduncan@suzannaskitchen.com. The USDA Meat and Poultry Hotline is also available at 888-674-6854 or questions can be submitted to the email mphotline@usda.gov.\n\nWhat is listeria monocytogenes?\n\nListeria monocytogenes, more commonly known as listeria, is a disease-causing bacteria that can be found in soil, water, sewage, rotting vegetation and animals, according to the USDA. It can survive and grow in refrigeration and can thrive in unsanitary food production conditions.\n\nWhat are listeria symptoms?\n\nListeria infects about 1,600 people each year, according to the Centers for Disease Prevention and Control.\n\nListeria symptoms vary per person but there are two forms of the disease:\n\nA less severe, non-invasive gastrointestinal listeriosis may appear as mid symptoms, like fever, muscle aches, nausea, vomiting and diarrhea. These symptoms may continue for one to three days, according to the USDA.\n\nA more severe, life-threatening invasive form of the disease may appear as a headache, stiff neck, confusion, loss of balance and convulsions, the USDA reports. This more invasive form can be life-threatening to newborns, pregnant people, adults over 65 and folks with weakened immune systems.\n\nGreta Cross is a national trending reporter at USA TODAY. Story idea? Email her at gcross@usatoday.com.",
  "images": [
    "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/09/05/PSPR/75090989007-t-staff-photos-00070-1.jpg?crop=2998,2999,x0,y0&width=48&height=48&format=pjpg&auto=webp",
    "https://www.usatoday.com/gciaf/prod/p?a=pageview&p=USAT-TEALIUM-TANGENT&m=web&k=f14ebdd6-0569-4c64-af73-99937bc06379&s=noscript",
    "https://www.usatoday.com/gcdn/authoring/authoring-images/2026/01/19/USAT/88251775007-getty-images-694764148.jpg?crop=2126,1197,x0,y140&width=2126&height=1197&format=pjpg&auto=webp"
  ]
}